#### ❌ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-07T16:11:26Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base



Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Finding latest version of hashicorp/local...
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Installing hashicorp/local v2.6.1...
- Installed hashicorp/local v2.6.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=matchpoint-runners]
spot_spotnodepool.this: Refreshing state... [id=db6b5a18-41a4-4d75-9ed5-da36cb86f2e2]
terraform_data.setup_spotctl_config: Refreshing state... [id=920f71a4-50fe-27cd-0c39-fa70b76cd3ef]
terraform_data.wait_for_cluster: Refreshing state... [id=b8579665-203e-965d-ebf1-e7248fdb2ca1]
terraform_data.fetch_kubeconfig: Refreshing state... [id=908ebc2b-052c-6ca7-299a-92df067675c4]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.local_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "kubeconfig" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "./kubeconfig.yaml"
      + id                   = (known after apply)
    }

  # terraform_data.fetch_kubeconfig must be replaced
-/+ resource "terraform_data" "fetch_kubeconfig" {
      ~ id               = "908ebc2b-052c-6ca7-299a-92df067675c4" -> (known after apply)
      - input            = "matchpoint-runners" -> null
      - output           = "matchpoint-runners" -> null
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # terraform_data.setup_spotctl_config must be replaced
-/+ resource "terraform_data" "setup_spotctl_config" {
      ~ id               = "920f71a4-50fe-27cd-0c39-fa70b76cd3ef" -> (known after apply)
      - input            = "matchpoint-runners" -> null
      - output           = "matchpoint-runners" -> null
      + triggers_replace = [
          + "matchpoint-runners",
        ]
    }

  # terraform_data.wait_for_cluster must be replaced
-/+ resource "terraform_data" "wait_for_cluster" {
      ~ id               = "b8579665-203e-965d-ebf1-e7248fdb2ca1" -> (known after apply)
      - input            = "matchpoint-runners" -> null
      - output           = "matchpoint-runners" -> null
      + triggers_replace = [
          + (known after apply),
        ]
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_endpoint       = "https://hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com" -> (known after apply)
  ~ cluster_token          = (sensitive value)
  ~ kubeconfig_raw         = (sensitive value)
  - nodepool_id            = "db6b5a18-41a4-4d75-9ed5-da36cb86f2e2" -> null
  + nodepool_name          = "db6b5a18-41a4-4d75-9ed5-da36cb86f2e2"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]

Planning failed. OpenTofu encountered an error while generating this plan.


Error: Get "https://hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com/api/v1/namespaces/argocd": dial tcp: lookup hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com on 127.0.0.53:53: no such host

  with kubernetes_namespace_v1.argocd,
  on main.tf line 40, in resource "kubernetes_namespace_v1" "argocd":
  40: resource "kubernetes_namespace_v1" "argocd" {

time=2026-01-07T16:11:37Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T16:11:37Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base has finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T16:11:37Z level=info msg=
Error: Get "https://hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com/api/v1/namespaces/argocd": dial tcp: lookup hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com on 127.0.0.53:53: no such host

  with kubernetes_namespace_v1.argocd,
  on main.tf line 40, in resource "kubernetes_namespace_v1" "argocd":
  40: resource "kubernetes_namespace_v1" "argocd" {

time=2026-01-07T16:11:37Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 

time=2026-01-07T16:11:37Z level=error msg=1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1


```
</details>